public class CyclesFunctions {
//    Задание 11.1
//    Даны несколько заголовков цикла for. Для каждого из них:  • укажите, какие значения будет принимать переменная-счетчик;
//• сколько раз выполняется цикл;
//1. for (int i=l; i<=34; i++)
//2. for (int i=l5; i<=34; i++)
//3. for (int i=21; i<34; i++)
//4. for (int i=l; i<=34; i+=3)
//5. for (int i=17; i<77; i+=lO)
//6. for (int i=l; i<=9; i+=2)
//7. for (int i=19; i>=l; i--)
//8. for (int i= 19; i>=9; i--)
//9. for (int i=29; i>10; i--)
//10. for (int i=9; i>=l; i-=4)
//11. for (int i=99; i>=O; i-=10)
//
//    Задание 11.2
//    Даны описания заголовков циклов. Напишите эти заголовки на языке Java.
// 1. Цикл выполняется 17 раз, начальное значение переменной-счетчика равно 12.
// 2. Цикл выполняется 7 раз, конечное значение переменной-счетчика равно 45.
// 3. Цикл выполняется 300 раз, начальное значение переменной-счетчика равно 1, ее значение должно увеличиваться каждый раз на 5.
// 4. Цикл выполняется 20 раз, начальное значение переменной-счетчика равно 1, ее значение должно уменьшаться каждый раз на 10.
// 5. Цикл выполняется 300 раз, конечное значение переменной-счетчика равно 1, ее значение должно уменьшаться каждый раз на 1.
// 6. Цикл выполняется 25 раз, конечное значение переменной-счетчика равно 1, ее значение должно уменьшаться каждый раз на 7.



}
