public class mathModFunctions {
//    Задание 4.1
//    Напишите класс, который принимает с клавиатуры целое положительное двузначное число и выводит на экран его цифры, разделенные
//    знаком «пробел».
//
//    Задание 4.2
//    Напишите класс, который принимает с клавиатуры целое положительное трехзначное число и выводит на экран его цифры, разделенные
//    знаком «пробел».
//
//    Задание 4.3
//    Напишите класс, который принимает с клавиатуры целое положительное двузначное число и выводит на экран его цифры, разделенные
//    знаком «пробел», но в обратном порядке. То есть для числа 45 будет
//    выведено на экран 5 4.
//
//    Задание 4.4
//    Напишите класс, который принимает с клавиатуры целое положительное трехзначное число и выводит на экран его цифры, разделенные
//    знаком «пробел», но в обратном порядке. То есть для числа 415 будет
//    выведено на экран 5 1 4.
//
//    Задание 4.5
//    Напишите класс, который принимает с клавиатуры целое положительное двузначное число и выводит его на экран
//        в «полном виде»: например, для числа 34 это будет выглядеть как 30+4.
//
//    Задание 4.6
//    Напишите класс, который принимает с клавиатуры целое положительное трехзначное число и выводит его на экран
//        в «полном виде»: например, для числа 364 это будет выглядеть как 300+60+4.
//
//    Задание 4.7
//    Напишите класс, который принимает с клавиатуры целое положительное двузначное число.
//    Затем следует построить новое значение, составленное из цифр числа, введенного с клавиатуры, но в обратном
//    порядке. После этого новое значение следует увеличить на 8, и окончательный результат вывести на экран.
//    То есть для числа 37 следует построить число 73 и вывести на экран 81.
//
//    Задание 4.11
//    Назовем «длиной двузначного числа» разницу между числом десятков
//            (первая цифра) и числом единиц (вторая цифра).
//    Напишите класс, который принимает с клавиатуры двузначное число и
//    выводит на экран его «длину».
//
//    Задание 4.12
//    Назовем «длиной трехзначного числа» разницу между его первой (число сотен) и последней (число единиц) цифрами, умноженную на его
//    среднюю (число десятков) цифру.
//    Напишите класс, который принимает с клавиатуры целое положительное трехзначное число, вычисляет его «длину» и выводит результат на
//    экран.
}
