package NewFunctions;

public class LogicalFunctions {

//    static Scanner reader = new Scanner(System.in);
//    public static void main(String[) args){
//        int х = reader.nextlnt();
//        int y = reader.nextlnt();
//        if (х < у) System.out.println("х меньше у");
//        if (х == у) System.out.println("х теперь равна у");
//        if (х > у) System.out.println("х теперь больше у");
//    }
//
//Задание 6.1 Дан класс (программа):
//1. Что будет выведено на экран, если с клавиатуры введены значения 5 и 9?
//2. Что будет выведено на экран, если с клавиатуры введены значения 9 и 9?
//3. Что будет выведено на экран, если с клавиатуры введены значения 9 и 5?
//4. Приведите пример вводимых с клавиатуры данных, для которых на экран будет выведено сообщение х меньше у.
//5. Приведите пример вводимых с клавиатуры данных, для которых на экран будет выведено сообщение х теперь больше у.
//6. Приведите пример вводимых с клавиатуры данных, для которых на экран будет выведено сообщение х теперь меньше у.


//    static Scanner reader = new Scanner(System.in);
//
//    public static void main(StringO args) {
//        int age;
//        System.out.print("Bвeди свой возраст");
//        age = input.nextlnt();
//        if (age >= l8) System.out.println("Можешь участвовать в выборах");
//    }
//Дан класс (программа):
// 1. Что будет выведено на экран, если с клавиатуры введено значение 8?
// 2. Что будет выведено на экран, если с клавиатуры введено значение 19?
// 3. Что будет выведено на экран, если с клавиатуры введено значение 18?32 Раздел 6
// 4. Приведите пример значения, которое надо ввести с клавиатуры, чтобы на экран выводилось сообщение Можешь участвовать ввыборах.
// 5. Приведите пример значения, которое надо ввести с клавиатуры, чтобы на экран не выводилось сообщение Можешь участвовать в выборах.
// 6. Как надо изменить код класса, чтобы кроме сообщения Можешь участвовать в выборах выводилось на экран - в нужных случаях! - сообщение Не можешь

//    Задание 8.14
//    Напишите класс, который принимает с клавиатуры двузначное положительное число и проверяет, является ли в нем первая цифра (десятков) больше второй (единиц). В соответствии с результатом проверки
//    надо вывести на экран соответствующее текстовое сообщение.
//
//    Задание 8.15
//    Напишите класс, который принимает с клавиатуры двузначное положительное число и проверяет, какая из его двух цифр является большей. В соответствии с результатом проверки надо вывести на экран
//    соответствующее текстовое сообщение. Не следует выводить на экран
//    никакого сообщения, если число составлено из одинаковых цифр.
//
//    Задание 8.16
//    Трехзначное число называется «симметричным», если первая и последняя его цифры одинаковы.
//    Напишите класс, который принимает с клавиатуры трехзначное положительное число и проверяет, является ли оно «симметричным». В соответствии с результатом проверки надо вывести на экран соответствующее текстовое сообщение.

}
