package NewFunctions;

public class VariablesFunc {

    public static void main(String[] args) {
task210();
task211();
    }
//    Задание 2.1
//    Напишите класс, который выводит на экран надпись "Hello, world!"
//
//    Задание 2.2
//    Напишите класс, который выводит на экран надпись "H-e-1-1-o-,-f-r-i-e-n-d!"
//
//    Задание 2.3
//    Напишите класс, который выводит на экран в первой строке три знака «+»,во второй - четыре знака«!», в третьей - два знака«?».
//
//    Задание 2.4
//    Напишите класс, который выводит на экран тем же количеством команд знаки, которые выводились в задании № 3, но все знаки должны
//    выводиться в одной строке.
//
//    Задание 2.8
//    Напишите класс, который присваивает переменной х значение 6, а затем выводит на экран: в первой строке - это значение, во второй -
//    квадрат этого значения, в третьей - куб этого значения.
//
//    Задание 2.9
//    Напишите класс, который присваивает переменной х значение 9, а затем выводит на экран: в первой строке - это значение с поясняющей
//    надписью (например, «значение х равно 9»), а во второй - квадрат
//    этого значения (тоже с поясняющей надписью).
//
//    Задание 2.10
//    Напишите класс, который присваивает двум переменным значения, а
//    затем выводит на экран: в первой строке значения обеих переменных, во второй - произведение этих переменных, в третьей - сумму этих переменных.
    public static void task210(){
        int a = 3;
        int b = 5;
    System.out.println(a*b);
    System.out.println("a*b");
    }

//    Задание 2.11
//    Напишите класс, который выводит на экран в одной строке ваше имя и
//    фамилию, в друтой - телефон, все это - в рамке из «звездочек» ().
  public static void task211() {
      System.out.println("***********");
      System.out.println("*имя фамилия*");
      System.out.println("*09889*");
      System.out.println("***********");
  }
//    Например:
//    7-841-266666
//
//    Задание 2.12
//    Напишите класс, который выводит на экран «песочные часы», составленные из какого-либо символа.
//
//    Задание 2.34
//    Напишите класс, который сначала заносит в переменную строковое значение Привет, а затем принимает с клавиатуры ваше имя.
//    Класс должен вывести на экран в одной строке сообщение, составленное из строкового значения Привет, знака «запятая» и вашего имени.
}
